Annihilation1019/STM32-based-Self-Balancing-Vehicle/Hardware/OLED.c
#include "stm32f1xx.h"
#include "OLED_Font.h"
#include "main.h"
#include "i2c.h"
#include "OLED.h"

#define Hardware_I2C // 硬件I2C
// #define Software_I2C // 软件I2C

#ifdef Software_I2C

/*引脚配置*/
#define OLED_W_SCL(x) HAL_GPIO_WritePin(I2C_SCL_GPIO_Port, I2C_SCL_Pin, (x) ? GPIO_PIN_SET : GPIO_PIN_RESET)
#define OLED_W_SDA(x) HAL_GPIO_WritePin(I2C_SDA_GPIO_Port, I2C_SDA_Pin, (x) ? GPIO_PIN_SET : GPIO_PIN_RESET)

/* IIC延时函数 */
#define DELAY_TIME 2 // 不是精确的延时时间，168MHz只需要延时一点点就可以了
void IIC_Delay()
{
	for (int i = 0; i < DELAY_TIME; i++)
	{
		__NOP(); // 空操作
	}
}

/*引脚初始化*/
void OLED_I2C_Init(void)
{
	OLED_W_SCL(1);
	OLED_W_SDA(1);
}

/**
 * @brief  I2C开始
 * @param  无
 * @retval 无
 */
void OLED_I2C_Start(void)
{
	OLED_W_SDA(1);
	OLED_W_SCL(1);
	IIC_Delay();
	OLED_W_SDA(0);
	IIC_Delay();
	OLED_W_SCL(0);
	IIC_Delay();
}

/**
 * @brief  I2C停止
 * @param  无
 * @retval 无
 */
void OLED_I2C_Stop(void)
{
	OLED_W_SDA(0);
	IIC_Delay();
	OLED_W_SCL(1);
	IIC_Delay();
	OLED_W_SDA(1);
	IIC_Delay();
}

/**
 * @brief  I2C发送一个字节
 * @param  Byte 要发送的一个字节
 * @retval 无
 */
void OLED_I2C_SendByte(uint8_t Byte)
{
	uint8_t i;
	for (i = 0; i < 8; i++)
	{
		OLED_W_SDA(Byte & (0x80 >> i));
		IIC_Delay();
		OLED_W_SCL(1);
		IIC_Delay();
		OLED_W_SCL(0);
		IIC_Delay();
	}
	OLED_W_SCL(1); // 额外的一个时钟，不处理应答信号
	IIC_Delay();
	OLED_W_SCL(0);
	IIC_Delay();
}

/**
 * @brief  OLED写命令
 * @param  Command 要写入的命令
 * @retval 无
 */
void OLED_WriteCommand(uint8_t Command)
{
	OLED_I2C_Start();
	OLED_I2C_SendByte(0x78); // 从机地址
	OLED_I2C_SendByte(0x00); // 写命令
	OLED_I2C_SendByte(Command);
	OLED_I2C_Stop();
}

/**
 * @brief  OLED写数据
 * @param  Data 要写入的数据
 * @retval 无
 */
void OLED_WriteData(uint8_t Data)
{
	OLED_I2C_Start();
	OLED_I2C_SendByte(0x78); // 从机地址
	OLED_I2C_SendByte(0x40); // 写数据
	OLED_I2C_SendByte(Data);
	OLED_I2C_Stop();
}

/**
 * @brief  OLED设置光标位置
 * @param  Y 以左上角为原点，向下方向的坐标，范围：0~7
 * @param  X 以左上角为原点，向右方向的坐标，范围：0~127
 * @retval 无
 */
void OLED_SetCursor(uint8_t Y, uint8_t X)
{
	OLED_WriteCommand(0xB0 | Y);				 // 设置Y位置
	OLED_WriteCommand(0x10 | ((X & 0xF0) >> 4)); // 设置X位置高4位
	OLED_WriteCommand(0x00 | (X & 0x0F));		 // 设置X位置低4位
}

/**
 * @brief  OLED清屏
 * @param  无
 * @retval 无
 */
void OLED_Clear(void)
{
	uint8_t i, j;
	for (j = 0; j < 8; j++)
	{
		OLED_SetCursor(j, 0);
		for (i = 0; i < 128; i++)
		{
			OLED_WriteData(0x00);
		}
	}
}

/**
 * @brief  OLED初始化
 * @param  无
 * @retval 无
 */
void OLED_Init(void)
{
	uint32_t i, j;

	for (i = 0; i < 1000; i++) // 上电延时
	{
		for (j = 0; j < 1000; j++)
			;
	}

	OLED_I2C_Init(); // 端口初始化

	OLED_WriteCommand(0xAE); // 关闭显示

	OLED_WriteCommand(0xD5); // 设置显示时钟分频比/振荡器频率
	OLED_WriteCommand(0x80);

	OLED_WriteCommand(0xA8); // 设置多路复用率
	OLED_WriteCommand(0x3F);

	OLED_WriteCommand(0xD3); // 设置显示偏移
	OLED_WriteCommand(0x00);

	OLED_WriteCommand(0x40); // 设置显示开始行

	OLED_WriteCommand(0xA1); // 设置左右方向，0xA1正常 0xA0左右反置

	OLED_WriteCommand(0xC8); // 设置上下方向，0xC8正常 0xC0上下反置

	OLED_WriteCommand(0xDA); // 设置COM引脚硬件配置
	OLED_WriteCommand(0x12);

	OLED_WriteCommand(0x81); // 设置对比度控制
	OLED_WriteCommand(0xCF);

	OLED_WriteCommand(0xD9); // 设置预充电周期
	OLED_WriteCommand(0xF1);

	OLED_WriteCommand(0xDB); // 设置VCOMH取消选择级别
	OLED_WriteCommand(0x30);

	OLED_WriteCommand(0xA4); // 设置整个显示打开/关闭

	OLED_WriteCommand(0xA6); // 设置正常/倒转显示

	OLED_WriteCommand(0x8D); // 设置充电泵
	OLED_WriteCommand(0x14);

	OLED_WriteCommand(0xAF); // 开启显示

	OLED_Clear(); // OLED清屏
}

#endif

#ifdef Hardware_I2C

/*引脚初始化*/
void OLED_I2C_Init(void)
{
	// 由于是cubemx生成的代码，所以这里不需要再次初始化
}

/**
 * @brief  OLED写命令
 * @param  Command 要写入的命令
 * @retval 无
 */
void OLED_WriteCommand(uint8_t Command)
{
	uint8_t data[2];
	data[0] = 0x00; // 写命令
	data[1] = Command;
	HAL_I2C_Master_Transmit(&hi2c1, 0x78, data, 2, HAL_MAX_DELAY);
}

/**
 * @brief  OLED写数据
 * @param  Data 要写入的数据
 * @retval 无
 */
void OLED_WriteData(uint8_t Data)
{
	uint8_t data[2];
	data[0] = 0x40; // 写数据
	data[1] = Data;
	HAL_I2C_Master_Transmit(&hi2c1, 0x78, data, 2, HAL_MAX_DELAY);
}

/**
 * @brief  OLED设置光标位置
 * @param  Y 以左上角为原点，向下方向的坐标，范围：0 ~ 7
 * @param  X 以左上角为原点，向右方向的坐标，范围：0 ~ 127
 * @retval 无
 */
void OLED_SetCursor(uint8_t Y, uint8_t X)
{
	OLED_WriteCommand(0xB0 | Y);				 // 设置Y位置
	OLED_WriteCommand(0x10 | ((X & 0xF0) >> 4)); // 设置X位置高4位
	OLED_WriteCommand(0x00 | (X & 0x0F));		 // 设置X位置低4位
}

/**
 * @brief  OLED清屏
 * @param  无
 * @retval 无
 */
void OLED_Clear(void)
{
	uint8_t i, j;
	for (j = 0; j < 8; j++)
	{
		OLED_SetCursor(j, 0);
		for (i = 0; i < 128; i++)
		{
			OLED_WriteData(0x00);
		}
	}
}

/**
 * @brief  OLED初始化
 * @param  无
 * @retval 无
 */
void OLED_Init(void)
{
	uint32_t i, j;

	for (i = 0; i < 1000; i++) // 上电延时
	{
		for (j = 0; j < 1000; j++)
			;
	}

	OLED_I2C_Init(); // 端口初始化

	OLED_WriteCommand(0xAE); // 关闭显示

	OLED_WriteCommand(0xD5); // 设置显示时钟分频比/振荡器频率
	OLED_WriteCommand(0x80);

	OLED_WriteCommand(0xA8); // 设置多路复用率
	OLED_WriteCommand(0x3F);

	OLED_WriteCommand(0xD3); // 设置显示偏移
	OLED_WriteCommand(0x00);

	OLED_WriteCommand(0x40); // 设置显示开始行

	OLED_WriteCommand(0xA1); // 设置左右方向，0xA1正常 0xA0左右反置

	OLED_WriteCommand(0xC8); // 设置上下方向，0xC8正常 0xC0上下反置

	OLED_WriteCommand(0xDA); // 设置COM引脚硬件配置
	OLED_WriteCommand(0x12);

	OLED_WriteCommand(0x81); // 设置对比度控制
	OLED_WriteCommand(0xCF);

	OLED_WriteCommand(0xD9); // 设置预充电周期
	OLED_WriteCommand(0xF1);

	OLED_WriteCommand(0xDB); // 设置VCOMH取消选择级别
	OLED_WriteCommand(0x30);

	OLED_WriteCommand(0xA4); // 设置整个显示打开/关闭

	OLED_WriteCommand(0xA6); // 设置正常/倒转显示

	OLED_WriteCommand(0x8D); // 设置充电泵
	OLED_WriteCommand(0x14);

	OLED_WriteCommand(0xAF); // 开启显示

	OLED_Clear(); // OLED清屏
}

#endif

/**
 * @brief  OLED显示一个字符
 * @param  Line 行位置
 *         - OLED_8x6模式：范围：1 ~ 32
 *         - OLED_12x6模式：范围：1 ~ 4
 *         - OLED_8x16模式：范围：1 ~ 4
 * 	       - OLED_24x12模式：范围：1 ~ 2
 * @param  Column 列位置
 *         - OLED_8x6模式：范围：1 ~ 21
 *         - OLED_12x6模式：范围：1 ~ 21
 *         - OLED_8x16模式：范围：1 ~ 16
 * 	       - OLED_24x12模式：范围：1 ~ 10
 * @param  Char 要显示的一个字符，范围：ASCII可见字符
 * @param  Mode 字体大小，取值：OLED_8x6、OLED_12x6、OLED_8x16、OLED_24x12
 * @retval 无
 * @note  8x6大小的部分ASCII字符会显示错误
 */
void OLED_ShowChar(uint8_t Line, uint8_t Column, char Char, enum OLED_MODE Mode)
{
	uint8_t i;
	switch (Mode)
	{
	case OLED_8x16:
		OLED_SetCursor((Line - 1) * 2, (Column - 1) * 8); // 设置光标位置在上半部分
		for (i = 0; i < 8; i++)
		{
			OLED_WriteData(OLED_F8x16[Char - ' '][i]); // 显示上半部分内容
		}
		OLED_SetCursor((Line - 1) * 2 + 1, (Column - 1) * 8); // 设置光标位置在下半部分
		for (i = 0; i < 8; i++)
		{
			OLED_WriteData(OLED_F8x16[Char - ' '][i + 8]); // 显示下半部分内容
		}
		break;

	case OLED_8x6:
		OLED_SetCursor((Line - 1), (Column - 1) * 6); // 设置光标位置
		for (i = 0; i < 6; i++)
		{
			OLED_WriteData(OLED_F8x6[Char - ' '][i]); // 显示字符内容
		}
		break;

	case OLED_12x6:
		OLED_SetCursor((Line - 1) * 2, (Column - 1) * 6); // 设置光标位置在上半部分
		for (i = 0; i < 6; i++)
		{
			OLED_WriteData(OLED_F12x6[Char - ' '][i]); // 显示上半部分内容
		}
		OLED_SetCursor((Line - 1) * 2 + 1, (Column - 1) * 6); // 设置光标位置在下半部分
		for (i = 0; i < 6; i++)
		{
			OLED_WriteData(OLED_F12x6[Char - ' '][i + 6]); // 显示下半部分内容
		}
		break;

	case OLED_24x12:
		OLED_SetCursor((Line - 1) * 3, (Column - 1) * 12); // 设置光标位置在上三分之一部分
		for (i = 0; i < 12; i++)
		{
			OLED_WriteData(OLED_F24x12[Char - ' '][i]); // 显示上三分之一部分内容
		}
		OLED_SetCursor((Line - 1) * 3 + 1, (Column - 1) * 12); // 设置光标位置在中三分之一部分
		for (i = 0; i < 12; i++)
		{
			OLED_WriteData(OLED_F24x12[Char - ' '][i + 12]); // 显示中三分之一部分内容
		}
		OLED_SetCursor((Line - 1) * 3 + 2, (Column - 1) * 12); // 设置光标位置在下三分之一部分
		for (i = 0; i < 12; i++)
		{
			OLED_WriteData(OLED_F24x12[Char - ' '][i + 24]); // 显示下三分之一部分内容
		}
		break;
	}
}

/**
 * @brief  OLED显示字符串
 * @param  Line 行位置
 *         - OLED_8x6模式：范围：1 ~ 32
 *         - OLED_12x6模式：范围：1 ~ 4
 *         - OLED_8x16模式：范围：1 ~ 4
 * 	       - OLED_24x12模式：范围：1 ~ 2
 * @param  Column 列位置
 *         - OLED_8x6模式：范围：1 ~ 21
 *         - OLED_12x6模式：范围：1 ~ 21
 *         - OLED_8x16模式：范围：1 ~ 16
 * 	       - OLED_24x12模式：范围：1 ~ 10
 * @param  String 要显示的字符串，范围：ASCII可见字符
 * @param  Mode 字体大小，取值：OLED_8x6、OLED_12x6、OLED_8x16、OLED_24x12
 * @retval 无
 * @note  8x6大小的部分ASCII字符会显示错误
 */
void OLED_ShowString(uint8_t Line, uint8_t Column, char *String, enum OLED_MODE Mode)
{
	uint8_t i;
	for (i = 0; String[i] != '\0'; i++)
	{
		OLED_ShowChar(Line, Column + i, String[i], Mode);
	}
}

/**
 * @brief  OLED次方函数
 * @param  X 底数
 * @param  Y 幂
 * @retval 返回值等于X的Y次方
 */
uint32_t OLED_Pow(uint32_t X, uint32_t Y)
{
	uint32_t Result = 1;
	while (Y--)
	{
		Result *= X;
	}
	return Result;
}

/**
 * @brief  OLED显示数字（十进制，正数）
 * @param  Line 行位置
 *         - OLED_8x6模式：范围：1 ~ 32
 *         - OLED_12x6模式：范围：1 ~ 4
 *         - OLED_8x16模式：范围：1 ~ 4
 * 	       - OLED_24x12模式：范围：1 ~ 2
 * @param  Column 列位置
 *         - OLED_8x6模式：范围：1 ~ 21
 *         - OLED_12x6模式：范围：1 ~ 21
 *         - OLED_8x16模式：范围：1 ~ 16
 * 	       - OLED_24x12模式：范围：1 ~ 10
 * @param  Number 要显示的数字，范围：0 ~ 4294967295
 * @param  Length 要显示数字的长度，范围：1 ~ 10
 * @retval 无
 * @note   8x6大小的部分ASCII字符会显示错误
 */
void OLED_ShowNum(uint8_t Line, uint8_t Column, uint32_t Number, uint8_t Length, enum OLED_MODE Mode)
{
	uint8_t i;
	for (i = 0; i < Length; i++)
	{
		OLED_ShowChar(Line, Column + i, Number / OLED_Pow(10, Length - i - 1) % 10 + '0', Mode);
	}
}

/**
 * @brief  OLED显示数字（十进制，带符号数）
 * @param  Line 行位置
 *         - OLED_8x6模式：范围：1 ~ 32
 *         - OLED_12x6模式：范围：1 ~ 4
 *         - OLED_8x16模式：范围：1 ~ 4
 * 	       - OLED_24x12模式：范围：1 ~ 2
 * @param  Column 列位置
 *         - OLED_8x6模式：范围：1 ~ 21
 *         - OLED_12x6模式：范围：1 ~ 21
 *         - OLED_8x16模式：范围：1 ~ 16
 * 	       - OLED_24x12模式：范围：1 ~ 10
 * @param  Number 要显示的数字，范围：-2147483648 ~ 2147483647
 * @param  Length 要显示数字的长度，范围：1 ~ 10
 * @param  Mode 字体大小，取值：OLED_8x6、OLED_12x6、OLED_8x16、OLED_24x12
 * @retval 无
 * @note   8x6大小的部分ASCII字符会显示错误
 */
void OLED_ShowSignedNum(uint8_t Line, uint8_t Column, int32_t Number, uint8_t Length, enum OLED_MODE Mode)
{
	uint8_t i;
	uint32_t Number1;
	if (Number >= 0)
	{
		OLED_ShowChar(Line, Column, '+', Mode);
		Number1 = Number;
	}
	else
	{
		OLED_ShowChar(Line, Column, '-', Mode);
		Number1 = -Number;
	}
	for (i = 0; i < Length; i++)
	{
		OLED_ShowChar(Line, Column + i + 1, Number1 / OLED_Pow(10, Length - i - 1) % 10 + '0', Mode);
	}
}

/**
 * @brief  OLED显示数字（十六进制，正数）
 * @param  Line 行位置
 *         - OLED_8x6模式：范围：1 ~ 32
 *         - OLED_12x6模式：范围：1 ~ 4
 *         - OLED_8x16模式：范围：1 ~ 4
 * 	       - OLED_24x12模式：范围：1 ~ 2
 * @param  Column 列位置
 *         - OLED_8x6模式：范围：1 ~ 21
 *         - OLED_12x6模式：范围：1 ~ 21
 *         - OLED_8x16模式：范围：1 ~ 16
 * 	       - OLED_24x12模式：范围：1 ~ 10
 * @param  Number 要显示的数字，范围：0 ~ 0xFFFFFFFF
 * @param  Length 要显示数字的长度，范围：1 ~ 8
 * @param  Mode 字体大小，取值：OLED_8x6、OLED_12x6、OLED_8x16、OLED_24x12
 * @retval 无
 * @note   8x6大小的部分ASCII字符会显示错误
 */
void OLED_ShowHexNum(uint8_t Line, uint8_t Column, uint32_t Number, uint8_t Length, enum OLED_MODE Mode)
{
	uint8_t i, SingleNumber;
	for (i = 0; i < Length; i++)
	{
		SingleNumber = Number / OLED_Pow(16, Length - i - 1) % 16;
		if (SingleNumber < 10)
		{
			OLED_ShowChar(Line, Column + i, SingleNumber + '0', Mode);
		}
		else
		{
			OLED_ShowChar(Line, Column + i, SingleNumber - 10 + 'A', Mode);
		}
	}
}

/**
 * @brief  OLED显示数字（二进制，正数）
 * @param  Line 行位置
 *         - OLED_8x6模式：范围：1 ~ 32
 *         - OLED_12x6模式：范围：1 ~ 4
 *         - OLED_8x16模式：范围：1 ~ 4
 * 	       - OLED_24x12模式：范围：1 ~ 2
 * @param  Column 列位置
 *         - OLED_8x6模式：范围：1 ~ 21
 *         - OLED_12x6模式：范围：1 ~ 21
 *         - OLED_8x16模式：范围：1 ~ 16
 * 	       - OLED_24x12模式：范围：1 ~ 10
 * @param  Number 要显示的数字，范围：0 ~ 1111 1111 1111 1111
 * @param  Length 要显示数字的长度，范围：1 ~ 16
 * @param  Mode 字体大小，取值：OLED_8x6、OLED_12x6、OLED_8x16、OLED_24x12
 * @retval 无
 * @note   8x6大小的部分ASCII字符会显示错误
 */
void OLED_ShowBinNum(uint8_t Line, uint8_t Column, uint32_t Number, uint8_t Length, enum OLED_MODE Mode)
{
	uint8_t i;
	for (i = 0; i < Length; i++)
	{
		OLED_ShowChar(Line, Column + i, Number / OLED_Pow(2, Length - i - 1) % 2 + '0', Mode);
	}
}